eSavjetovaliste/app/controllers/feedbacks_controller.rb

  def index
    @feedbacks = Feedback.all
---
SELECT "feedbacks".* FROM "feedbacks"