eSavjetovaliste/app/controllers/api/categories_controller.rb

INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Fri, 20 Mar 2015 18:49:38 UTC +00:00], ["name", "Doktor"], ["updated_at", Fri, 20 Mar 2015 18:49:38 UTC +00:00]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save