eSavjetovaliste/app/controllers/api/comments_controller.rb

SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("created_at", "description", "name", "question_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Fri, 20 Mar 2015 19:09:59 UTC +00:00], ["description", "opis"], ["name", "Komentar 6"], ["question_id", 1], ["updated_at", Fri, 20 Mar 2015 19:09:59 UTC +00:00]]
---
  def create
    @question = Question.find(params[:question_id])
    @comment = @question.comments.build(comment_params)
    #@comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save

UPDATE "comments" SET "name" = $1, "updated_at" = $2 WHERE "comments"."id" = 5  [["name", "Irma i Kanita"], ["updated_at", Fri, 20 Mar 2015 18:22:23 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @comment.update(comment_params)