eSavjetovaliste/app/controllers/api/passwordresets_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'nermincatic1@gmail.com' LIMIT 1
SELECT 1 AS one FROM "users" WHERE (LOWER("users"."email") = LOWER('irmabalic1@gmail.com') AND "users"."id" != 29) LIMIT 1
---
  def create
    user_email = params[:email]
    user = user_email.present? && User.find_by(email: user_email)

SELECT "users".* FROM "users" WHERE "users"."password_reset_token" = 'FqYYRNjbJB2TaJ3tcRyhbg' LIMIT 1
---
  def edit
    #provjera da li postoji user sa ovim password_reset_token-om
    # TBD hashiranje
  	user = User.find_by!(password_reset_token: params[:id])

SELECT "users".* FROM "users" WHERE "users"."password_reset_token" = 'SJ2dw5rKbclm4wF4re21sw' LIMIT 1
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = 29  [["password_digest", "$2a$10$kmvifRnhkxErMKVMtbLIQeRYWBH0.LWkpYkdShtnPH41ij9bnkyem"], ["updated_at", Mon, 06 Apr 2015 08:00:16 UTC +00:00]]
---
  def update
    user_new_password = params[:password]
    user_new_password_confirmation = params[:password_confirmation]
    user = User.find_by!(password_reset_token: params[:id])
    if user
        user.password = user_new_password
        user.password_confirmation = user_new_password_confirmation
        user.save