eSavjetovaliste/app/controllers/api/questions_controller.rb

SELECT "questions".* FROM "questions" WHERE "questions"."category_id" = 1 LIMIT 1
SELECT "questions".* FROM "questions"
---
  def index
      begin
        if params[:category_id] #&& params[:user_id]
          @questions = Question.where("category_id = ?", params[:category_id])
        else
          @questions = Question.all

INSERT INTO "questions" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Fri, 20 Mar 2015 16:09:52 UTC +00:00], ["name", "Pitanje"], ["updated_at", Fri, 20 Mar 2015 16:09:52 UTC +00:00]]
---
  def create
    @question = Question.new(question_params)

    respond_to do |format|
      if @question.save

UPDATE "questions" SET "description" = $1, "updated_at" = $2 WHERE "questions"."id" = 1  [["description", "Opis za Pitanje"], ["updated_at", Fri, 20 Mar 2015 19:02:42 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @question.update(question_params)

SELECT "comments".* FROM "comments" WHERE "comments"."question_id" = 1
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 4]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 1]]
---
  def destroy
    @comments = Comment.where(question_id: @question.id)
    @comments.each do |comment|
      comment.destroy
    end
    @question.destroy