eSavjetovaliste/app/controllers/api/reservations_controller.rb

  def index
      begin
        if params[:status] # Search by status
          @reservations = Reservation.where("status = ?", params[:status])
        elsif params[:user_doctor_id] # Search by doctor
          @reservations = Reservation.where("user_doctor_id = ?", params[:user_doctor_id])
        else
          @reservations = Reservation.all
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."status" = 'W' LIMIT 1
SELECT "reservations".* FROM "reservations"

  def create
    # user=logged_user
    # on create - only user, appointment and status (by default Waiting)

    @reservation = Reservation.new(reservation_params)
    @reservation.status = "W"

    respond_to do |format|
      if @reservation.save
---
INSERT INTO "reservations" ("appointment_date", "created_at", "description", "receive_date", "status", "updated_at", "user_patient_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def confirm
    @reservation = Reservation.find(params[:id])
    @reservation.user_doctor = User.find(params[:user_doctor_id])
    @reservation.user_receive = User.find(params[:user_receive_id])
    @reservation.confirm_date = Time.now
    @reservation.status = "A"
    if @reservation.update(reservation_params)
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT 1  [["id", "2"]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "12"]]
UPDATE "reservations" SET "user_doctor_id" = $1, "user_receive_id" = $2, "confirm_date" = $3, "status" = $4, "updated_at" = $5 WHERE "reservations"."id" = 2  [["user_doctor_id", 12], ["user_receive_id", 12], ["confirm_date", Mon, 23 Mar 2015 21:33:29 UTC +00:00], ["status", "A"], ["updated_at", Mon, 23 Mar 2015 21:33:29 UTC +00:00]]

  def decline
   @reservation = Reservation.find(params[:id])
   @reservation.status = "D"
   if @reservation.update(reservation_params)
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "reservations" SET "status" = $1, "updated_at" = $2 WHERE "reservations"."id" = 2  [["status", "D"], ["updated_at", Mon, 23 Mar 2015 21:37:50 UTC +00:00]]