eSavjetovaliste/app/controllers/api/roles_controller.rb

  def create
    @role = Role.new(role_params)

    respond_to do |format|
      if @role.save
---
INSERT INTO "roles" ("created_at", "description", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Sun, 22 Mar 2015 13:39:21 UTC +00:00], ["description", "Neki opis"], ["name", "pacijent"], ["updated_at", Sun, 22 Mar 2015 13:39:21 UTC +00:00]]