eSavjetovaliste/app/controllers/api/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'sunita@gmail.com' LIMIT 1
---
  def create
      user_password = params[:password]
      user_email = params[:email]
      user = user_email.present? && User.find_by(email: user_email)