eSavjetovaliste/app/controllers/api/users_controller.rb

  def change_password
    user_password = params[:password]
    user_email = params[:email]
    user_new_password = params[:new_password]
    user_new_password_confirmation = params[:new_password_confirmation]
    user = user_email.present? && User.find_by(email: user_email)

      if user.try(:authenticate, user_password)
          user.password = user_new_password
          user.password_confirmation = user_new_password_confirmation
          user.save
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'merima__1@hotmail.com' LIMIT 1
SELECT 1 AS one FROM "users" WHERE (LOWER("users"."email") = LOWER('merima__1@hotmail.com') AND "users"."id" != 10) LIMIT 1
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = 10  [["password_digest", "$2a$10$BsEeb0dEIFr4LVqY5MwCcOyoBz4C7KRXqwhRgupil/S0JExRkFiEy"], ["updated_at", Mon, 06 Apr 2015 19:31:50 UTC +00:00]]

  def register
    @user = User.new(user_params)
    # default role: Gost
    @role = Role.find_by(name:"gost")
    @user.role = @role
    # default status : Waiting
    @user.confirmed = "W"
    # json response
    respond_to do |format|
      if !verify_recaptcha(:model => @user, :message => "CAPTCHA unos nije tacan!") && @user.save
---
SELECT "roles".* FROM "roles" WHERE "roles"."name" = 'gost' LIMIT 1
INSERT INTO "users" ("adress", "auth_token", "confirmed", "created_at", "email", "job", "name", "password_digest", "phone", "role_id", "surname", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def create
    @user = User.new(user_params)
    # default status : Waiting
    @user.confirmed = "W"
    # json response
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "name", "surname", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 20 Mar 2015 15:07:47 UTC +00:00], ["name", "Irma"], ["surname", "Balic"], ["updated_at", Fri, 20 Mar 2015 15:07:47 UTC +00:00]]

  def update
    user = current_user

    if user.update(user_params)
---
UPDATE "users" SET "surname" = $1, "job" = $2, "updated_at" = $3 WHERE "users"."id" = 4  [["surname", "Balic"], ["job", "it"], ["updated_at", Fri, 20 Mar 2015 15:41:13 UTC +00:00]]